Repository: kozlyuk/envista
Catalog: locale/*/LC_MESSAGES/django.po
Languages: uk

source: Activate your Envista account.
uk: Активуйте Ваш Envista аккаунт.

source: Thank you for your email confirmation. You will be able to log in to your account after being activated by administrator.
uk: Дякуємо за підтвердження електронної адреси.Ви можете авторизуватись після підтвердження облікового запису адміністратором.

source: Activation link is invalid!
uk: Код активації не валідний

source: Password
uk: Пароль

source: Password confirmation
uk: Підтвердження пароля

source: User with such email already exist
uk: Користувач з такою електронною адресою вже існує

source: You can change the password using <a href="../password/">this form</a>.
uk: Ви можете змінити пароль <a href="../password/">за цим посиланням</a>.

source: Users must have an email address
uk: Користувач повинен мати електронну адресу

source: Email address
uk: Електронна адреса

source: Mobile number
uk: Мобільний телефон

source: Address
uk: Адреса

source: Comment
uk: Коментар

source: Product title
uk: Назва продукту

source: Short description
uk: Опис продукту

source: Product image
uk: Картинка продукту

source: Brand name
uk: Назва бренду

source: Brand Image
uk: Логотип бренду

source: Specification
uk: Специфікація

source: Telegram bot url
uk: Посилання на Telegram бота

source: Site footer
uk: Футер сайту

source: Product
uk: Продукт

source: Products
uk: Продукти

source: Value
uk: Значення

source: Diopter Power
uk: Сфера

source: Diopter Powers
uk: Сфери

source: Cylinder
uk: Циліндер

source: Cylinders
uk: Циліндри

source: Product price
uk: Ціна продукту

source: Quantity in hand
uk: Кількість на складі

source: Product Instance
uk: Екземпляр продукту

source: Product Instances
uk: Екземпляри продукту

source: Order status
uk: Статус замовлення

source: Quantity must be more then 0
uk: Кількість має бути більша 0

source: Product is not enough in stock. Available - {}
uk: Не достатня кількість на складі. Доступно - {}

source: New orders status can be changed to Confirmed or Canceled
uk: Статус замовлення може бути змінений на Підтверджено або Скасовано

source: Cancelled orders can't be changed
uk: Відмінені замовлення не можуть бути змінені

source: Returned orders can't be changed
uk: Повернені замовлення не можуть бути змінені

source: Few carts exists
uk: Існує декілька кошиків

source: Product does not exist
uk: Такого продукту не існує

source: Cart does not exist
uk: Корзина не існує

source: Product added to the cart
uk: Продукт додано до кошика

source: Product is out of stock
uk: Не достатня кількість товару на складі

source: Product updated
uk: Кількість продукту оновлено

source: Product not in cart
uk: Продукт відсутній в кошику

source: Order accepted. Wait for call from manager please!
uk: Замовлення прийнято. Чекайте на дзвінок менеджера.

source: Order if empty! Please add products
uk: Кошик порожній. Додайте товари

source: Purchase does not exist
uk: Продукт не існує

source: Few purchases exists
uk: Існує декілька закупівель

source: Product added to the purchase
uk: Продукт додано до закупівлі

source: Purchase accepted.
uk: Закупівлю збережено

source: Purchase is empty! Please add products
uk: Закупівля порожня! Додайте товари

source: Purchase cleared.
uk: Закупівлю обнулено

source: Goods
uk: Товари

source: Invoice number
uk: Номер замовлення

source: Created by
uk: Створив

source: Date created
uk: Дата створення

source: Date updated
uk: Дата оновлення

source: Purchase
uk: Закупівля

source: Purchases
uk: Закупівлі

source: Generate invoice number
uk: Генерація номеру Замовлення

source: Products in cart
uk: Продукт в кошику

source: New order
uk: Нове замовлення

source: Order canceled
uk: Замовлення скасовано

source: Order confirmed
uk: Замовлення підтверджено

source: Order returned
uk: Замовлення повернуто

source: Customer
uk: Покупець

source: Price
uk: Ціна

source: Sum
uk: Кількість

source: Order
uk: Замовлення

source: Orders
uk: Замовлення

source: Total order value
uk: Загальна вартість замовлення

source: Total available value
uk: Вартість доступного замовлення

source: Total preorder value
uk: Вартість попереднього замовлення

source: Total lenses count in order
uk: Кількість товарів в замовлені

source: Quantity
uk: Кількість

source: Unit price
uk: Ціна за одиницю

source: Order type
uk: Тип замовлення

source: Calculated invoice_line value
uk: Розрахунок вартості позиції

source: New
uk: Нові

source: Add
uk: Адреса

source: View
uk: Переглянути

source: Change
uk: Змінити

source: You don't have permission to view or edit anything.
uk: Ви не маєте доступу до перегляду або редагування будь чого
