/*
 * @author     Andrey Perestyuk (Arrathilar)
 * @email       a.perestyuk@itel.rv.ua
 * @email       arrathilar@blizzard.com, a.perestyuk@archlinux.org,
 * @copyright  2020 ITEL-Service
 *
 */

import React, {useState} from "react";
import {Collapse} from "reactstrap";

const ContentPolicy = (props) => {
  const [isOpen, setIsOpen] = useState(false);

  const toggle = () => setIsOpen(!isOpen);
  return (
    <>
      <p>
        Надаю Товариству з обмеженою відповідальністю <b>«Оптідея Плюс» (далі – Володілець)</b> добровільну та безумовну
        згоду на
        обробку моїх персональних даних, а саме: <b>прізвища, імені, по батькові, дати і року народження, номер
        мобільного
        телефону, адресу електронної пошти</b> в наступних цілях:
      </p>
      <p>
        • Для інформування про проведення і (або) організації моєї участі в науково-практичних або освітніх заходах у
        сфері охорони здоров'я та фармацевтики, а також заходах, спрямованих на інформування медичних і фармацевтичних
        працівників про продукцію групи компаній Володільця;
      </p>
      <p>
        • Для поширення наукової, освітньої, рекламної та іншої інформації;
      </p>
      <p>
        • Для проведення маркетингових досліджень, опитувань, інших заходів і оцінки задоволеності якістю продукції
        групи
        компаній Володільця.
      </p>
      <p>
        Я надаю згоду, що зазначена вище інформація може надаватися мені за електронною поштою, так і за телефоном
        (дзвінок/SMS/месенджер)
        Я надаю безумовну згоду на будь-які дії по обробці моїх персональних даних в документальній та / або електронній
        формі (включаючи, але не обмежуючись, збір, запис, систематизацію, накопичення, зберігання, уточнення
        (оновлення,
        зміну), використання, знеособлення, блокування, видалення, знищення персональних даних; на надання часткового
        або
        повного права обробки моїх персональних даних іншим суб'єктам відносин, пов'язаних із персональними даними (у
        тому
        числі й іноземним); на передачу будь-яким особам (у тому числі й іноземним) відомостей про мене з баз
        персональних
        даних (поширення персональних даних) без окремих дозволів та письмових повідомлень мене про це відповідно
        внутрішніх нормативних документів Володільця.
        Я надаю безумовну згоду на безстрокове зберігання моїх персональних даних та на те, що порядок доступу третіх
        осіб
        до моїх персональних даних буде визначений самостійно Володільцем персональних даних, а також на внесення змін
        до
        моїх персональних даних за зверненням інших суб'єктів відносин, пов'язаних із персональними даними без окремих
        дозволів та письмових повідомлень мене про це.
        Відповідно до ч.2 ст. 12 Закону України «Про захист персональних даних» повідомлений, про те, що: Володільцем
        персональних даних є ТОВ «Оптідея Плюс».
        Склад та зміст зібраних персональних даних, мета збору персональних даних осіб, яким передаються його
        персональні
        дані вказується у даній згоді, та є актуальним та дійсними на момент надання згоди.
        Про свої права відповідно до статті 8 <b><a target="_blank" href="https://zakon.rada.gov.ua/laws/show/2297-17">Закону
        України «Про захист персональних даних» від 01.06.2010 № 2297-VI</a></b> повідомлений Права суб’єкта
        персональних
        даних у сфері захисту персональних даних
      </p>
      <a onClick={toggle} style={{marginBottom: '2rem', color: "#007bff", cursor: "pointer"}}>Вміст статті 8 Закону
        України «Про захист
        персональних даних»
        від 01.06.2010 № 2297-VI</a>
      <Collapse isOpen={isOpen}>
        <p>
          Особисті немайнові права на персональні дані, які має кожна фізична особа, є невід’ємними і непорушними.
          <p>
            Суб'єкт персональних даних має право:
          </p>
          <p>
            1) знати про джерела збирання, місцезнаходження своїх персональних даних, мету їх обробки, місцезнаходження
            або
            місце проживання (перебування) володільця чи розпорядника персональних даних або дати відповідне доручення
            щодо
            отримання цієї інформації уповноваженим ним особам, крім випадків, встановлених законом;
          </p>
          <p>
            2) отримувати інформацію про умови надання доступу до персональних даних, зокрема інформацію про третіх
            осіб,
            яким
            передаються його персональні дані;
          </p>
          <p>
            3) на доступ до своїх персональних даних;
          </p>
          <p>
            4) отримувати не пізніш як за тридцять календарних днів з дня надходження запиту, крім випадків,
            передбачених
            законом, відповідь про те, чи обробляються його персональні дані, а також отримувати зміст таких
            персональних
            даних;
          </p>
          <p>
            5) пред'являти вмотивовану вимогу володільцю персональних даних із запереченням проти обробки своїх
            персональних
            даних;
          </p>
          <p>
            6) пред'являти вмотивовану вимогу щодо зміни або знищення своїх персональних даних будь-яким володільцем та
            розпорядником персональних даних, якщо ці дані обробляються незаконно чи є недостовірними;
          </p>
          <p>
            7) на захист своїх персональних даних від незаконної обробки та випадкової втрати, знищення, пошкодження у
            зв'язку
            з умисним приховуванням, ненаданням чи несвоєчасним їх наданням, а також на захист від надання відомостей,
            що
            є
            недостовірними чи ганьблять честь, гідність та ділову репутацію фізичної особи;
          </p>
          <p>
            8) звертатися із скаргами на обробку своїх персональних даних до Уповноваженого або до суду;
          </p>
          <p>
            9) застосовувати засоби правового захисту в разі порушення законодавства про захист персональних даних;
          </p>
          <p>
            10) вносити застереження стосовно обмеження права на обробку своїх персональних даних під час надання згоди;
          </p>
          <p>
            11) відкликати згоду на обробку персональних даних;
          </p>
          <p>
            12) знати механізм автоматичної обробки персональних даних;
          </p>
          <p>
            13) на захист від автоматизованого рішення, яке має для нього правові наслідки.
          </p>
        </p>
      </Collapse>
    </>
  )
}

export default ContentPolicy;
